sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_comp.c
     Callbacks can be registered/unregistered in @ref HAL_COMP_STATE_READY state only.
     Exception done MspInit/MspDeInit functions that can be registered/unregistered
     in @ref HAL_COMP_STATE_READY or @ref HAL_COMP_STATE_RESET state,
     thus registered (user) MspInit/DeInit callbacks can be used during the Init/DeInit.
    [..]

     Then, the user first registers the MspInit/MspDeInit user callbacks
     using @ref HAL_COMP_RegisterCallback() before calling @ref HAL_COMP_DeInit()
     or @ref HAL_COMP_Init() function.
     [..]

     When the compilation flag USE_HAL_COMP_REGISTER_CALLBACKS is set to 0 or
     not defined, the callback registration feature is not available and all callbacks
     are set to the corresponding weak functions.

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "py32f003_hal.h"

/** @addtogroup PY32F003_HAL_Driver
  * @{
  */

#ifdef HAL_COMP_MODULE_ENABLED



/** @defgroup COMP COMP
  * @brief COMP HAL module driver
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup COMP_Private_Constants
  * @{
  */

/* Delay for COMP startup time.                                               */
/* Note: Delay required to reach propagation delay specification.             */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tSTART").                                                       */
/* Unit: us                                                                   */
#define COMP_DELAY_STARTUP_US          (80UL) /*!< Delay for COMP startup time */

/* Delay for COMP voltage scaler stabilization time.                          */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tSTART_SCALER").                                                */
/* Unit: us                                                                   */
#define COMP_DELAY_VOLTAGE_SCALER_STAB_US (200UL)  /*!< Delay for COMP voltage scaler stabilization time */

#define COMP_OUTPUT_LEVEL_BITOFFSET_POS    (30UL)

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @defgroup COMP_Exported_Functions COMP Exported Functions
  * @{
  */

/** @defgroup COMP_Exported_Functions_Group1 Initialization/de-initialization functions
  *  @brief    Initialization and de-initialization functions.
  *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This section provides functions to initialize and de-initialize comparators

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the COMP according to the specified
  *         parameters in the COMP_InitTypeDef and initialize the associated handle.
  * @note   If the selected comparator is locked, initialization can't be performed.
  *         To unlock the configuration, perform a system reset.
  * @param  hcomp  COMP handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_COMP_Init(COMP_HandleTypeDef *hcomp)
{
    uint32_t tmp_csr;
    uint32_t exti_line;
    uint32_t comp_voltage_scaler_initialized; /* Value "0" if comparator voltage scaler is not initialized */
    __IO uint32_t wait_loop_index = 0UL;
    HAL_StatusTypeDef status = HAL_OK;

    /* Check the COMP handle allocation and lock status */
    if(hcomp == NULL)
    {
        status = HAL_ERROR;
    }
    else if(__HAL_COMP_IS_LOCKED(hcomp))
    {
        status = HAL_ERROR;
    }
    else
    {
        /* Check the parameters */
        assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));
        assert_param(IS_COMP_INPUT_PLUS(hcomp->Instance, hcomp->Init.InputPlus));
        assert_param(IS_COMP_INPUT_MINUS(hcomp->Instance, hcomp->Init.InputMinus));
        assert_param(IS_COMP_OUTPUTPOL(hcomp->Init.OutputPol));
        assert_param(IS_COMP_POWERMODE(hcomp->Init.Mode));
        assert_param(IS_COMP_HYSTERESIS(hcomp->Init.Hysteresis));
        assert_param(IS_COMP_BLANKINGSRC_INSTANCE(hcomp->Instance, hcomp->Init.BlankingSrce));
        assert_param(IS_COMP_TRIGGERMODE(hcomp->Init.TriggerMode));
        assert_param(IS_COMP_WINDOWMODE(hcomp->Init.WindowMode));
        if(hcomp->Init.WindowMode != COMP_WINDOWMODE_DISABLE)
        {
            assert_param(IS_COMP_WINDOWOUTPUT(hcomp->Init.WindowOutput));
        }

        if(hcomp->State == HAL_COMP_STATE_RESET)
        {
            /* Allocate lock resource and initialize it */
            hcomp->Lock = HAL_UNLOCKED;

            /* Set COMP error code to none */
            COMP_CLEAR_ERRORCODE(hcomp);


#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
            /* Init the COMP Callback settings */
            hcomp->TriggerCallback = HAL_COMP_TriggerCallback; /* Legacy weak callback */

            if (hcomp->MspInitCallback == NULL)
            {
                hcomp->MspInitCallback = HAL_COMP_MspInit; /* Legacy weak MspInit  */
            }

            /* Init the low level hardware */
            /* Note: Internal control clock of the comparators must                 */
            /*       be enabled in "HAL_COMP_MspInit()"                             */
            /*       using "__HAL_RCC_SYSCFG_CLK_ENABLE()".                         */
            hcomp->MspInitCallback(hcomp);
#else
            /* Init the low level hardware */
            /* Note: Internal control clock of the comparators must                 */
            /*       be enabled in "HAL_COMP_MspInit()"                             */
            /*       using "__HAL_RCC_SYSCFG_CLK_ENABLE()".                         */
            HAL_COMP_MspInit(hcomp);
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
        }

        /* Memorize voltage scaler state before initialization */
        comp_voltage_scaler_initialized = READ_BIT(hcomp->Instance->CSR, (COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0));

