sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_comp.c
        /* Set COMP parameters */
        tmp_csr = (  hcomp->Init.InputMinus
                     | hcomp->Init.InputPlus
                     | hcomp->Init.BlankingSrce
                     | hcomp->Init.Hysteresis
                     | hcomp->Init.OutputPol
                     | hcomp->Init.Mode
                  );

        /* Set parameters in COMP register */
        /* Note: Update all bits except read-only, lock and enable bits */
        MODIFY_REG(hcomp->Instance->CSR,
                   COMP_CSR_LOCK  | COMP_CSR_COMP_OUT | COMP_CSR_PWRMODE |
                   COMP_CSR_POLARITY | COMP_CSR_WINMODE | COMP_CSR_INPSEL | COMP_CSR_INMSEL |
                   COMP_CSR_SCALER_EN | COMP_CSR_EN,
                   tmp_csr
                  );

        /* Set window mode */
        /* Note: Window mode bit is located into 1 out of the 2 pairs of COMP     */
        /*       instances. Therefore, this function can update another COMP      */
        /*       instance that the one currently selected.                        */
        if(hcomp->Init.WindowMode == COMP_WINDOWMODE_COMP1_INPUT_PLUS_COMMON)
        {
            CLEAR_BIT(COMP12_COMMON->CSR_ODD, COMP_CSR_WINMODE);
            SET_BIT(COMP12_COMMON->CSR_EVEN, COMP_CSR_WINMODE);
        }
        else if(hcomp->Init.WindowMode == COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON)
        {
            SET_BIT(COMP12_COMMON->CSR_ODD, COMP_CSR_WINMODE);
            CLEAR_BIT(COMP12_COMMON->CSR_EVEN, COMP_CSR_WINMODE);
        }
        else
        {
            CLEAR_BIT(COMP12_COMMON->CSR_ODD, COMP_CSR_WINMODE);
            CLEAR_BIT(COMP12_COMMON->CSR_EVEN, COMP_CSR_WINMODE);
        }

        /* Set window mode output */
        /* Note: Window mode mode output can also be used when window mode        */
        /*       is disabled, to use comparators in independent mode with their   */
        /*       output connected through exclusive-or circuitry.                 */
        switch (hcomp->Init.WindowOutput)
        {
        case COMP_WINDOWOUTPUT_COMP1:
            SET_BIT(COMP12_COMMON->CSR_ODD, COMP_CSR_WINOUT);
            CLEAR_BIT(COMP12_COMMON->CSR_EVEN, COMP_CSR_WINOUT);
            break;

        case COMP_WINDOWOUTPUT_COMP2:
            CLEAR_BIT(COMP12_COMMON->CSR_ODD, COMP_CSR_WINOUT);
            SET_BIT(COMP12_COMMON->CSR_EVEN, COMP_CSR_WINOUT);
            break;

        case COMP_WINDOWOUTPUT_BOTH:
            SET_BIT(COMP12_COMMON->CSR_ODD, COMP_CSR_WINOUT);
            SET_BIT(COMP12_COMMON->CSR_EVEN, COMP_CSR_WINOUT);
            break;

        default: /* COMP_WINDOWOUTPUT_EACH_COMP */
            CLEAR_BIT(COMP12_COMMON->CSR_ODD, COMP_CSR_WINOUT);
            CLEAR_BIT(COMP12_COMMON->CSR_EVEN, COMP_CSR_WINOUT);
            break;
        }

        /* Delay for COMP scaler bridge voltage stabilization */
        /* Apply the delay if voltage scaler bridge is required and not already enabled */
        if ((READ_BIT(hcomp->Instance->CSR, (COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0)) != 0UL) &&
                (comp_voltage_scaler_initialized == 0UL)               )
        {
            /* Wait loop initialization and execution */
            /* Note: Variable divided by 2 to compensate partially              */
            /*       CPU processing cycles, scaling in us split to not          */
            /*       exceed 32 bits register capacity and handle low frequency. */
            wait_loop_index = ((COMP_DELAY_VOLTAGE_SCALER_STAB_US / 10UL) * (SystemCoreClock / (100000UL * 2UL)));
            while(wait_loop_index != 0UL)
            {
                wait_loop_index--;
            }
        }

        /* Get the EXTI line corresponding to the selected COMP instance */
        exti_line = COMP_GET_EXTI_LINE(hcomp->Instance);

        /* Manage EXTI settings */
        if((hcomp->Init.TriggerMode & (COMP_EXTI_IT | COMP_EXTI_EVENT)) != 0UL)
        {
            /* Configure EXTI rising edge */
            if((hcomp->Init.TriggerMode & COMP_EXTI_RISING) != 0UL)
            {
                LL_EXTI_EnableRisingTrig_0_31(exti_line);
            }
            else
            {
                LL_EXTI_DisableRisingTrig_0_31(exti_line);
            }

            /* Configure EXTI falling edge */
            if((hcomp->Init.TriggerMode & COMP_EXTI_FALLING) != 0UL)
            {
                LL_EXTI_EnableFallingTrig_0_31(exti_line);
            }
            else
            {
                LL_EXTI_DisableFallingTrig_0_31(exti_line);
            }

            /* Clear COMP EXTI pending bit (if any) */
            LL_EXTI_ClearFlag_0_31(exti_line);
            //    LL_EXTI_ClearFallingFlag_0_31(exti_line);

            /* Configure EXTI event mode */
            if((hcomp->Init.TriggerMode & COMP_EXTI_EVENT) != 0UL)
            {
                LL_EXTI_EnableEvent_0_31(exti_line);
            }
            else
            {
                LL_EXTI_DisableEvent_0_31(exti_line);
            }

            /* Configure EXTI interrupt mode */
            if((hcomp->Init.TriggerMode & COMP_EXTI_IT) != 0UL)
            {
                LL_EXTI_EnableIT_0_31(exti_line);
            }
            else
            {
                LL_EXTI_DisableIT_0_31(exti_line);
            }
        }
        else
        {
            /* Disable EXTI event mode */
            LL_EXTI_DisableEvent_0_31(exti_line);

            /* Disable EXTI interrupt mode */
            LL_EXTI_DisableIT_0_31(exti_line);
        }

        /* Set HAL COMP handle state */
        /* Note: Transition from state reset to state ready,                      */
        /*       otherwise (coming from state ready or busy) no state update.     */
        if (hcomp->State == HAL_COMP_STATE_RESET)
        {
            hcomp->State = HAL_COMP_STATE_READY;
        }
    }

    return status;
}

/**
  * @brief  DeInitialize the COMP peripheral.
  * @note   Deinitialization cannot be performed if the COMP configuration is locked.
  *         To unlock the configuration, perform a system reset.
  * @param  hcomp  COMP handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_COMP_DeInit(COMP_HandleTypeDef *hcomp)
{
    HAL_StatusTypeDef status = HAL_OK;

