sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_comp.c
    /* Check the COMP handle allocation and lock status */
    if(hcomp == NULL)
    {
        status = HAL_ERROR;
    }
    else if(__HAL_COMP_IS_LOCKED(hcomp))
    {
        status = HAL_ERROR;
    }
    else
    {
        /* Check the parameter */
        assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

        /* Set COMP_CSR register to reset value */
        WRITE_REG(hcomp->Instance->CSR, 0x00000000UL);

#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
        if (hcomp->MspDeInitCallback == NULL)
        {
            hcomp->MspDeInitCallback = HAL_COMP_MspDeInit; /* Legacy weak MspDeInit  */
        }

        /* DeInit the low level hardware: GPIO, RCC clock, NVIC */
        hcomp->MspDeInitCallback(hcomp);
#else
        /* DeInit the low level hardware: GPIO, RCC clock, NVIC */
        HAL_COMP_MspDeInit(hcomp);
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */

        /* Set HAL COMP handle state */
        hcomp->State = HAL_COMP_STATE_RESET;

        /* Release Lock */
        __HAL_UNLOCK(hcomp);
    }

    return status;
}

/**
  * @brief  Initialize the COMP MSP.
  * @param  hcomp  COMP handle
  * @retval None
  */
__weak void HAL_COMP_MspInit(COMP_HandleTypeDef *hcomp)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hcomp);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_COMP_MspInit could be implemented in the user file
     */
}

/**
  * @brief  DeInitialize the COMP MSP.
  * @param  hcomp  COMP handle
  * @retval None
  */
__weak void HAL_COMP_MspDeInit(COMP_HandleTypeDef *hcomp)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hcomp);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_COMP_MspDeInit could be implemented in the user file
     */
}

#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User COMP Callback
  *         To be used instead of the weak predefined callback
  * @param  hcomp Pointer to a COMP_HandleTypeDef structure that contains
  *                the configuration information for the specified COMP.
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_COMP_TRIGGER_CB_ID Trigger callback ID
  *          @arg @ref HAL_COMP_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref HAL_COMP_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_COMP_RegisterCallback(COMP_HandleTypeDef *hcomp, HAL_COMP_CallbackIDTypeDef CallbackID, pCOMP_CallbackTypeDef pCallback)
{
    HAL_StatusTypeDef status = HAL_OK;

    if (pCallback == NULL)
    {
        /* Update the error code */
        hcomp->ErrorCode |= HAL_COMP_ERROR_INVALID_CALLBACK;

        return HAL_ERROR;
    }

    if (HAL_COMP_STATE_READY == hcomp->State)
    {
        switch (CallbackID)
        {
        case HAL_COMP_TRIGGER_CB_ID :
            hcomp->TriggerCallback = pCallback;
            break;

        case HAL_COMP_MSPINIT_CB_ID :
            hcomp->MspInitCallback = pCallback;
            break;

        case HAL_COMP_MSPDEINIT_CB_ID :
            hcomp->MspDeInitCallback = pCallback;
            break;

        default :
            /* Update the error code */
            hcomp->ErrorCode |= HAL_COMP_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status = HAL_ERROR;
            break;
        }
    }
    else if (HAL_COMP_STATE_RESET == hcomp->State)
    {
        switch (CallbackID)
        {
        case HAL_COMP_MSPINIT_CB_ID :
            hcomp->MspInitCallback = pCallback;
            break;

        case HAL_COMP_MSPDEINIT_CB_ID :
            hcomp->MspDeInitCallback = pCallback;
            break;

        default :
            /* Update the error code */
            hcomp->ErrorCode |= HAL_COMP_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status = HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Update the error code */
        hcomp->ErrorCode |= HAL_COMP_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
    }

    return status;
}

/**
  * @brief  Unregister a COMP Callback
  *         COMP callback is redirected to the weak predefined callback
  * @param  hcomp Pointer to a COMP_HandleTypeDef structure that contains
  *                the configuration information for the specified COMP.
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_COMP_TRIGGER_CB_ID Trigger callback ID
  *          @arg @ref HAL_COMP_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref HAL_COMP_MSPDEINIT_CB_ID MspDeInit callback ID
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_COMP_UnRegisterCallback(COMP_HandleTypeDef *hcomp, HAL_COMP_CallbackIDTypeDef CallbackID)
{
    HAL_StatusTypeDef status = HAL_OK;

    if (HAL_COMP_STATE_READY == hcomp->State)
    {
        switch (CallbackID)
        {
        case HAL_COMP_TRIGGER_CB_ID :
            hcomp->TriggerCallback = HAL_COMP_TriggerCallback;         /* Legacy weak callback */
            break;

        case HAL_COMP_MSPINIT_CB_ID :
            hcomp->MspInitCallback = HAL_COMP_MspInit;                 /* Legacy weak MspInit */
            break;

        case HAL_COMP_MSPDEINIT_CB_ID :
            hcomp->MspDeInitCallback = HAL_COMP_MspDeInit;             /* Legacy weak MspDeInit */
            break;

        default :
            /* Update the error code */
            hcomp->ErrorCode |= HAL_COMP_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if (HAL_COMP_STATE_RESET == hcomp->State)
    {
        switch (CallbackID)
        {
        case HAL_COMP_MSPINIT_CB_ID :
            hcomp->MspInitCallback = HAL_COMP_MspInit;                 /* Legacy weak MspInit */
            break;

        case HAL_COMP_MSPDEINIT_CB_ID :
            hcomp->MspDeInitCallback = HAL_COMP_MspDeInit;             /* Legacy weak MspDeInit */
            break;

        default :
            /* Update the error code */
            hcomp->ErrorCode |= HAL_COMP_ERROR_INVALID_CALLBACK;

            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Update the error code */
        hcomp->ErrorCode |= HAL_COMP_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
    }

