sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_comp.c
    return status;
}

#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup COMP_Exported_Functions_Group2 Start-Stop operation functions
  *  @brief   Start-Stop operation functions.
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Start a comparator instance.
      (+) Stop a comparator instance.

@endverbatim
  * @{
  */

/**
  * @brief  Start the comparator.
  * @param  hcomp  COMP handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_COMP_Start(COMP_HandleTypeDef *hcomp)
{
    __IO uint32_t wait_loop_index = 0UL;
    HAL_StatusTypeDef status = HAL_OK;

    /* Check the COMP handle allocation and lock status */
    if(hcomp == NULL)
    {
        status = HAL_ERROR;
    }
    else if(__HAL_COMP_IS_LOCKED(hcomp))
    {
        status = HAL_ERROR;
    }
    else
    {
        /* Check the parameter */
        assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

        if(hcomp->State == HAL_COMP_STATE_READY)
        {
            /* Enable the selected comparator */
            SET_BIT(hcomp->Instance->CSR, COMP_CSR_EN);

            /* Set HAL COMP handle state */
            hcomp->State = HAL_COMP_STATE_BUSY;

            /* Delay for COMP startup time */
            /* Wait loop initialization and execution */
            /* Note: Variable divided by 2 to compensate partially              */
            /*       CPU processing cycles, scaling in us split to not          */
            /*       exceed 32 bits register capacity and handle low frequency. */
            wait_loop_index = ((COMP_DELAY_STARTUP_US / 10UL) * (SystemCoreClock / (100000UL * 2UL)));
            while(wait_loop_index != 0UL)
            {
                wait_loop_index--;
            }
        }
        else
        {
            status = HAL_ERROR;
        }
    }

    return status;
}

/**
  * @brief  Stop the comparator.
  * @param  hcomp  COMP handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_COMP_Stop(COMP_HandleTypeDef *hcomp)
{
    HAL_StatusTypeDef status = HAL_OK;

    /* Check the COMP handle allocation and lock status */
    if(hcomp == NULL)
    {
        status = HAL_ERROR;
    }
    else if(__HAL_COMP_IS_LOCKED(hcomp))
    {
        status = HAL_ERROR;
    }
    else
    {
        /* Check the parameter */
        assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

        /* Check compliant states: HAL_COMP_STATE_READY or HAL_COMP_STATE_BUSY    */
        /* (all states except HAL_COMP_STATE_RESET and except locked status.      */
        if(hcomp->State != HAL_COMP_STATE_RESET)
        {
            /* Disable the selected comparator */
            CLEAR_BIT(hcomp->Instance->CSR, COMP_CSR_EN);

            /* Set HAL COMP handle state */
            hcomp->State = HAL_COMP_STATE_READY;
        }
        else
        {
            status = HAL_ERROR;
        }
    }

    return status;
}

/**
  * @brief  Comparator IRQ handler.
  * @param  hcomp  COMP handle
  * @retval None
  */
void HAL_COMP_IRQHandler(COMP_HandleTypeDef *hcomp)
{
    /* Get the EXTI line corresponding to the selected COMP instance */
    uint32_t exti_line = COMP_GET_EXTI_LINE(hcomp->Instance);
    uint32_t comparator_window_mode_odd = READ_BIT(COMP12_COMMON->CSR_ODD, COMP_CSR_WINMODE);
    uint32_t comparator_window_mode_even = READ_BIT(COMP12_COMMON->CSR_EVEN, COMP_CSR_WINMODE);

    /* Check COMP EXTI flag */
    if(LL_EXTI_IsActiveFlag_0_31(exti_line) != 0UL)
    {
        /* Check whether comparator is in independent or window mode */
        if(   (comparator_window_mode_odd != 0UL)
                || (comparator_window_mode_even != 0UL))
        {
            /* Clear COMP EXTI line pending bit of the pair of comparators          */
            /* in window mode.                                                      */
            /* Note: Pair of comparators in window mode can both trig IRQ when      */
            /*       input voltage is changing from "out of window" area            */
            /*       (low or high ) to the other "out of window" area (high or low).*/
            /*       Both flags must be cleared to call comparator trigger          */
            /*       callback is called once.                                       */
            LL_EXTI_ClearFlag_0_31((COMP_EXTI_LINE_COMP1 | COMP_EXTI_LINE_COMP2));
        }
		else
		{
		  /* Clear COMP EXTI line pending bit */
		  LL_EXTI_ClearFlag_0_31(exti_line);
		}

        /* COMP trigger user callback */
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
        hcomp->TriggerCallback(hcomp);
#else
        HAL_COMP_TriggerCallback(hcomp);
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
    }
    else
    {
        /* nothing to do */
    }
}

/**
  * @}
  */

/** @defgroup COMP_Exported_Functions_Group3 Peripheral Control functions
  *  @brief   Management functions.
  *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the comparators.

@endverbatim
  * @{
  */

/**
  * @brief  Lock the selected comparator configuration.
  * @note   A system reset is required to unlock the comparator configuration.
  * @note   Locking the comparator from reset state is possible
  *         if __HAL_RCC_SYSCFG_CLK_ENABLE() is being called before.
  * @param  hcomp  COMP handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_COMP_Lock(COMP_HandleTypeDef *hcomp)
{
    HAL_StatusTypeDef status = HAL_OK;

    /* Check the COMP handle allocation and lock status */
    if(hcomp == NULL)
    {
        status = HAL_ERROR;
    }
    else if(__HAL_COMP_IS_LOCKED(hcomp))
    {
        status = HAL_ERROR;
    }
    else
    {
        /* Check the parameter */
        assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

